app/controllers/addresses_controller.rb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = $1  [["id", 9]]
---
  def destroy
    # debugger
    @address = Address.find_by(id: params[:id])
        if @address&.destroy