app/controllers/addresses_controller.rb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1 AND "addresses"."id" = $2 LIMIT $3  [["user_id", 8], ["id", 2], ["LIMIT", 1]]
---
  def show
    # byebug
      @address = @current_user.addresses.find_by(id: params[:id])

INSERT INTO "addresses" ("street_address", "city", "state", "zip_code", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    # byebug
    @address = Address.create(address_params.merge(user_id: @current_user.id))

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "addresses" SET "street_address" = $1, "city" = $2, "state" = $3, "updated_at" = $4 WHERE "addresses"."id" = $5  [["street_address", "anand nagar"], ["city", "bihar"], ["state", "west bengal"], ["updated_at", "2024-02-13 05:20:09.296387"], ["id", 2]]
---
  def update
  	 # debugger
     @address = Address.find_by(id: params[:id])
        if @address&.update(address_params)