app/controllers/carts_controller.rb

	def add_product
		cart = @current_user.cart.products
		select_product = Product.find(params[:id])

		if cart.include?(select_product)
			qul = select_product.quantities.where(user_id: @current_user.id).last
			qul.quantity += 1
			qul.quantity = params[:quantity] if params[:quantity].present?
			qul.update(quantity: qul.quantity)
		else
		   qul = Quantity.create(product_id: select_product.id, quantity:(params[:quantity] || 1), user_id: @current_user.id)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]
SELECT "products".* FROM "products" INNER JOIN "carts_products" ON "products"."id" = "carts_products"."product_id" WHERE "carts_products"."cart_id" = $1  [["cart_id", 8]]
SELECT 1 AS one FROM "products" INNER JOIN "carts_products" ON "products"."id" = "carts_products"."product_id" WHERE "carts_products"."cart_id" = $1 AND "products"."id" = $2 LIMIT $3  [["cart_id", 9], ["id", 2], ["LIMIT", 1]]
SELECT "quantities".* FROM "quantities" WHERE "quantities"."product_id" = $1 AND "quantities"."user_id" = $2 ORDER BY "quantities"."id" DESC LIMIT $3  [["product_id", 4], ["user_id", 14], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 13], ["LIMIT", 1]]
UPDATE "quantities" SET "quantity" = $1, "updated_at" = $2 WHERE "quantities"."id" = $3  [["quantity", nil], ["updated_at", "2024-02-20 06:43:13.229833"], ["id", 1]]
INSERT INTO "quantities" ("quantity", "product_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 1], ["product_id", 4], ["user_id", 14], ["created_at", "2024-02-20 06:41:18.605285"], ["updated_at", "2024-02-20 06:41:18.605285"]]

	def remove_product
	 unless @current_user
	 	render json: {error: "User not authenticated"}, status: :unauthorized
	 	return
	 end

	 unless @current_user.cart
	 	render json: {error: "user doest not have a cart"}, status: :unprocessable_entity
	 	return
	 end

      product = Product.find_by(id: params[:id])

      if product
      	cart = @current_user.cart
      	 if cart.products.include?(product)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 14], ["LIMIT", 1]]
SELECT 1 AS one FROM "products" INNER JOIN "carts_products" ON "products"."id" = "carts_products"."product_id" WHERE "carts_products"."cart_id" = $1 AND "products"."id" = $2 LIMIT $3  [["cart_id", 9], ["id", 6], ["LIMIT", 1]]