app/controllers/orders_controller.rb

     def show
       # @order = Order.find_by(id: params[:id]
      @order = @current_user.orders.find_by(id: params[:id])
       if @order.present?
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["user_id", 8], ["id", 1], ["LIMIT", 1]]

     def create
     	@products = @current_user.cart.products
     	order = Order.new(
     		  	   user_id: @current_user.id,
     		       order_number: generate_order_number,
                   total_mrp: calculate_total_mrp,
                   total_price: calculate_total_price,
                   discount: calculate_discount,
                   tax: calculate_tax,
                   payment_method: params[:payment_method],
                   address_id: params[:address_id]
                   )
     	    if order.save
---
INSERT INTO "orders" ("user_id", "order_number", "total_mrp", "total_price", "discount", "tax", "payment_method", "created_at", "updated_at", "address_id", "status") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"