app/controllers/password_resets_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "pradeep.kushwaha@poolstack.in"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 AND "users"."id" != $2 LIMIT $3  [["email", "mohit@gmail.com"], ["id", 10], ["LIMIT", 1]]
---
    def create
      	# debugger
          @user = User.find_by(email: params[:user_email])
          if @user.present?

SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = $1 LIMIT $2  [["reset_password_token", "[FILTERED]"], ["LIMIT", 1]]
---
      def edit
      	# debugger
      	@user = User.find_by(reset_password_token: params[:id])

SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = $1 LIMIT $2  [["reset_password_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def update
     # debugger
     @user = User.find_by(reset_password_token: params[:id])