app/controllers/passwords_controller.rb

		def update
		debugger
		@user = @current_user
		 if @user&.authenticate(params[:current_password])
			if @user.update(password: params[:new_password])
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "[FILTERED]"], ["updated_at", "2024-02-12 13:18:16.013751"], ["id", 5]]