app/controllers/payments_controller.rb

	def checkout
		@order = Order.find(params[:order_id])
		se = Stripe::Checkout::Session.create({
		  line_items: [
		    {
		      price_data: {
		        currency: 'usd',
		        # product_data: {name: "T-shirt"},
		        # unit_amount: 2000
		        product_data: {name: "#{@order.products.pluck(:title)}"},
		        unit_amount: @order.total_price.to_i * 100
		      },
		      quantity: 1,
		    }
		  ],
		  customer: @current_user.stripe_id,
# byebug
		  # customer_email: @current_user.email,  # Include customer email
		  billing_address_collection: 'required',  # Collect billing address
		  shipping_address_collection: {
		  allowed_countries: ['US'],  # Specify allowed shipping countries
		  },
		  mode: 'payment',
		  success_url: 'http://localhost:4242/success.html',
		  cancel_url: 'http://localhost:4242/cancel.html',
		})
		# byebug
		Payment.create(user_id: @current_user.id, order_id: @order.id, checkout_session_id: se.id, payment_status: "inprogress")
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "payments" ("payment_intent_id", "payment_status", "checkout_session_id", "user_id", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "products"."title" FROM "products" INNER JOIN "orders_products" ON "products"."id" = "orders_products"."product_id" WHERE "orders_products"."order_id" = $1  [["order_id", 1]]

	def retrive_checkout

		checkout_session = Stripe::Checkout::Session.retrieve(params[:checkout_session_id])
		@current_user.payments.last.update(
  				payment_status: checkout_session.payment_status,
  				payment_intent_id: checkout_session.payment_intent)
---
SELECT "payments".* FROM "payments" WHERE "payments"."user_id" = $1 ORDER BY "payments"."id" DESC LIMIT $2  [["user_id", 8], ["LIMIT", 1]]
UPDATE "payments" SET "payment_intent_id" = $1, "payment_status" = $2, "updated_at" = $3 WHERE "payments"."id" = $4  [["payment_intent_id", "pi_3Oj3zQSI1Y7AHsQa0Buy3VLT"], ["payment_status", "paid"], ["updated_at", "2024-02-12 18:13:28.936385"], ["id", 1]]