app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    # debugger
    @products = Product.all